In [15]:
import pandas as pd
import numpy as np
from pandas import DataFrame

#### 替换操作
  - 替换操作可以同步作用于Series和DataFrame中
  - 单值替换
    - 普通替换: 替换所有符合要求的元素: to_replace=15,value='e'
    - 按照指定单值替换: to_replace={列标签: 替换值} value='value'
  - 多值替换
    - 列表替换: to_replace=[] value=[]
    - 字典替换(推荐) to_replace=(to_replace:value,to_replace:value)

In [16]:
df = DataFrame(np.random.randint(0,100,size=(5,6)))
df

    0   1   2   3   4   5
0  96  79  70  39  27  41
1  20  13  95  68  47  58
2  47  92  95  71  37  37
3   7  92  89  17  72  16
4  42  85  45  84   7  21

In [17]:
df.replace(to_replace=16,value='Two') # 把16的值都进行替换

    0   1   2   3   4    5
0  96  79  70  39  27   41
1  20  13  95  68  47   58
2  47  92  95  71  37   37
3   7  92  89  17  72  Two
4  42  85  45  84   7   21

In [18]:
df.replace(to_replace={62:'John'}) # 把62的值都进行替换

    0   1   2   3   4   5
0  96  79  70  39  27  41
1  20  13  95  68  47  58
2  47  92  95  71  37  37
3   7  92  89  17  72  16
4  42  85  45  84   7  21

In [19]:
df.replace(to_replace={2:17},value='five') # 将2列的17替换为five
# 将指定列的元素进行替换to_replace={列标签: 被替换值} value='value'

    0   1   2   3   4   5
0  96  79  70  39  27  41
1  20  13  95  68  47  58
2  47  92  95  71  37  37
3   7  92  89  17  72  16
4  42  85  45  84   7  21

### 映射操作
  - 概念: 创建一个映射关系列表,把values元素和一个特定的标签或者字符串绑定(给一个元素值提供不同的表现形式)
  - 创建一个df,两列分别是姓名和薪资,然后给其名字起对应的英文名

In [20]:
dic = {
    'name': ['John','Jack','Tom','Marry','Zack'],
    'salary': [10000,4500,8000,6000,7000]
}
df = DataFrame(dic)
df

    name  salary
0   John   10000
1   Jack    4500
2    Tom    8000
3  Marry    6000
4   Zack    7000

In [21]:
# 创建一个映射关系列表
dic = {
    'John': '约翰',
    'Jack': '杰克',
    'Tom': '汤姆',
    'Marry': '玛丽',
    'Zack': '扎克'
}
df['e_name'] = df['name'].map(dic) # 将name列的值进行映射

- map是一个Series的方法,只能被Series调用

### 运算工具
  - 超过3000部分的钱缴纳50%的税,计算每个人的税后薪资

In [22]:
df

    name  salary e_name
0   John   10000     约翰
1   Jack    4500     杰克
2    Tom    8000     汤姆
3  Marry    6000     玛丽
4   Zack    7000     扎克

In [23]:
def after_sal(s):
    return s - (s-3000)*0.5
df['salary'].map(after_sal) # salary的每个元素都会被传入到after_sal函数中

0    6500.0
1    3750.0
2    5500.0
3    4500.0
4    5000.0
Name: salary, dtype: float64

### 排序实现的随机抽样
  - take()
  - np.random.permutation()

In [24]:
df = DataFrame(np.random.randint(0,100,size=(100,3)),columns=['A','B','C'])
df

     A   B   C
0   60  34  68
1   73  25  73
2   54  87  81
3   51  12   6
4   47  84   6
..  ..  ..  ..
95  75  77  53
96  99  84  17
97  92  34  27
98  45  48  99
99  20  90  22

[100 rows x 3 columns]

In [25]:
np.random.permutation(100) # 生成一个0-99的随机排列

array([61, 60, 70, 92, 82, 12,  2, 47, 74,  5, 31, 95, 62, 32, 22, 45, 79,
       41, 57, 15, 80,  6, 65, 54, 98, 13, 43,  9, 67, 17, 48, 75, 91, 68,
       29, 55, 11, 69, 21, 99, 30, 96, 14, 46, 50, 44, 33, 77, 51, 94, 72,
       63, 40, 42, 84, 37, 34, 27, 20, 26, 73, 52, 78, 76, 24, 28, 10,  4,
       16, 87, 18, 58,  7, 89, 86,  1, 53,  8, 49,  0, 36, 19, 39, 38, 93,
       90, 85, 25,  3, 83, 59, 66, 23, 81, 71, 88, 64, 56, 97, 35])

In [26]:
# 将原始数据打乱
df.take([2,0,1],axis=1) # axis=1表示按照列进行打乱

     C   A   B
0   68  60  34
1   73  73  25
2   81  54  87
3    6  51  12
4    6  47  84
..  ..  ..  ..
95  53  75  77
96  17  99  84
97  27  92  34
98  99  45  48
99  22  20  90

[100 rows x 3 columns]

In [27]:
# 将行和列都打乱,并且随机抽取50行
df.take(np.random.permutation(3),axis=1).take(np.random.permutation(100),axis=0)[0:50]

     C   A   B
7   54  87  31
75  96  33  25
43  41  84   7
62  98  82  23
48   7  19  65
0   68  60  34
69  33  76   7
78  10  85  45
56  66  27  23
1   73  73  25
22   8  78  76
50  58  55  65
67  69  76  27
70   3  43  78
44  89  15  60
73  17  69  42
18  10  87   3
82  18  88  73
37  75   7  50
42  93  11  28
58  31   7  82
29  59  59  57
3    6  51  12
16   8  85   0
89  24  61  23
40   4  20  58
97  27  92  34
77  23  34  44
53  49  87  72
11  76  22   1
30  36  83   2
32  33  81  41
98  99  45  48
59  75  14  99
74   5  88   7
45  88  10  51
83  90   3  63
91  11  11  56
26  80  95   8
2   81  54  87
80  64  63  72
88  47  92  69
28  45  78  58
20  80  21  90
79  26  20  84
24  20  95  16
63  93  67  28
72  53  47  73
68  59  58   7
6   79  64  59

### 数据的分类处理
  - 数据分类处理的核心
    - groupby()
    - groups属性查看分组情况

In [28]:
df = DataFrame({'item':['苹果','香蕉','橘子','苹果','香蕉','橘子'],
                'price':[4,3,3.5,4.5,3.2,3.8],
                'color':['red','yellow','yellow','green','green','yellow'],
                'weight':[12,20,21,15,16,19]})
df

  item  price   color  weight
0   苹果    4.0     red      12
1   香蕉    3.0  yellow      20
2   橘子    3.5  yellow      21
3   苹果    4.5   green      15
4   香蕉    3.2   green      16
5   橘子    3.8  yellow      19

In [29]:
# 对水果的种类进行分组
df.groupby(by='item')

In [30]:
# 查看详细的分组情况
df.groupby(by='item').groups

{'橘子': [2, 5], '苹果': [0, 3], '香蕉': [1, 4]}

In [31]:
# 计算出每一种水果的平均价值
df.groupby(by='item')['price'].mean()

item
橘子    3.65
苹果    4.25
香蕉    3.10
Name: price, dtype: float64

In [32]:
# 计算每一种颜色对应水果的平均重量
df.groupby(by='color')['weight'].mean()

color
green     15.5
red       12.0
yellow    20.0
Name: weight, dtype: float64

In [33]:
df

  item  price   color  weight
0   苹果    4.0     red      12
1   香蕉    3.0  yellow      20
2   橘子    3.5  yellow      21
3   苹果    4.5   green      15
4   香蕉    3.2   green      16
5   橘子    3.8  yellow      19

In [34]:
# 将计算出的平均重量汇总到源数据
df_dic = df.groupby(by='color')['weight'].mean().to_dict() # to_dict()将Series转换为字典
df['总数据'] = df['color'].map(df_dic)
df

  item  price   color  weight   总数据
0   苹果    4.0     red      12  12.0
1   香蕉    3.0  yellow      20  20.0
2   橘子    3.5  yellow      21  20.0
3   苹果    4.5   green      15  15.5
4   香蕉    3.2   green      16  15.5
5   橘子    3.8  yellow      19  20.0

### 高级数据聚合
  - 使用groupby()分组后,也可以使用transform()和apply()提供自定义函数实现更多运算
  - df.groupby('item')['price'].sum() <==> df.groupby('item')['price'].apply(sum)
  - transform()和apply()都可以进行运算
  - transform()和apply()也可以传入一个lambda表达式

In [35]:
def sup_sum(a):
    summ = 0
    for i in a:
        summ += i
        return summ

In [36]:
# 如果你想要对分组后的数据进行运算调用 my_mean函数, 那么就需要使用apply()函数
# 为什么要使用apply()函数呢? 不可以直接.my_mean()吗?
# 通常来说,使用“.”来调用方法的话,那么这个方法必须是需要被调用的对象的方法,所以我们需要使用apply()函数或者transform()函数
df.groupby(by='item')['price'].apply(sup_sum)

item
橘子    3.5
苹果    4.0
香蕉    3.0
Name: price, dtype: float64

### 数据加载

In [37]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv',header=20)
df

,20,1,3,"Masselmani, Mrs. Fatima",female,Unnamed: 5,0,0.1,2649,7.225,Unnamed: 10,C
0,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
1,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
2,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
3,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
4,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
866,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
867,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
868,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
869,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
870,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 读取CSV数据

In [38]:
# 连接数据库,获取连接对象
import sqlite3 as sql
connet = sql.connect('path')

In [39]:
# 读取数据库中的数据
sql_df = pd.read_sql('select * from table_name',con=connet)

DatabaseError: Execution failed on sql 'select * from table_name': no such table: table_name

In [ ]:
# 将一个df中的数据写入到db
df.to_sql('table_name',con=connet)

### 透视表
    - 透视表是一种可以对数据动态排布并且分类汇总的表格格式.后续大多数人都在Excel使用过数据透视表,也体会过它的强大功能,而在pandas中它被称作pivot_table()

In [34]:
import pandas as pd
import numpy as np
df = pd.read_csv("boll.csv",encoding='utf8')
df

     对手 胜负 主客场  命中  投篮数  投篮命中率  3分命中率  篮板  助攻  得分
0    勇士  胜   客  10   23  0.435  0.444   6  11  27
1    国王  胜   客   8   21  0.381  0.286   3   9  27
2    小牛  胜   主  10   19  0.526  0.462   3   7  29
3    灰熊  负   主   8   20  0.400  0.250   5   8  22
4   76人  胜   客  10   20  0.500  0.250   3  13  27
5    黄蜂  胜   客   8   18  0.444  0.400  10  11  27
6    灰熊  负   客   6   19  0.316  0.222   4   8  20
7   76人  负   主   8   21  0.381  0.429   4   7  29
8   尼克斯  胜   客   9   23  0.391  0.353   5   9  31
9    老鹰  胜   客   8   15  0.533  0.545   3  11  29
10   爵士  胜   主  19   25  0.760  0.875   2  13  56
11   骑士  胜   主   8   21  0.381  0.429  11  13  35
12   灰熊  胜   主  11   25  0.440  0.429   4   8  38
13  步行者  胜   客   9   21  0.429  0.250   5  15  26
14   猛龙  负   主   8   25  0.320  0.273   6  11  38
15   太阳  胜   客  12   22  0.545  0.545   2   7  48
16   灰熊  胜   客   9   20  0.450  0.500   5   7  29
17   掘金  胜   主   6   16  0.375  0.143   8   9  21
18  尼克斯  胜   主  12   27  0.444  0.385   2  10  37
19   篮网  胜   主  13   20  0.650  0.615  10   8  37
20  步行者  胜   主   8   22  0.364  0.333   8  10  29
21   湖人  胜   客  13   22  0.591  0.444   4   9  36
22   爵士  胜   客   8   19  0.421  0.333   5   3  29
23  开拓者  胜   客  16   29  0.552  0.571   8   3  48
24   鹈鹕  胜   主   8   16  0.500  0.400   1  17  26

### pivot_table()函数的参数
  - index: 分类汇总的分类条件
  - columns: 用于分组的列名
  - values: 用于聚合的列名(需要对计算的数据进行筛选)
  - aggfunc: 聚合函数或者函数列表

In [41]:
# 数据清洗
df['对手'] = df['对手'].astype(str)
df = df[df['对手'] != '76人'] # 把76人的数据清洗掉
df

     对手 胜负 主客场  命中  投篮数  投篮命中率  3分命中率  篮板  助攻  得分
0    勇士  胜   客  10   23  0.435  0.444   6  11  27
1    国王  胜   客   8   21  0.381  0.286   3   9  27
2    小牛  胜   主  10   19  0.526  0.462   3   7  29
3    灰熊  负   主   8   20  0.400  0.250   5   8  22
5    黄蜂  胜   客   8   18  0.444  0.400  10  11  27
6    灰熊  负   客   6   19  0.316  0.222   4   8  20
8   尼克斯  胜   客   9   23  0.391  0.353   5   9  31
9    老鹰  胜   客   8   15  0.533  0.545   3  11  29
10   爵士  胜   主  19   25  0.760  0.875   2  13  56
11   骑士  胜   主   8   21  0.381  0.429  11  13  35
12   灰熊  胜   主  11   25  0.440  0.429   4   8  38
13  步行者  胜   客   9   21  0.429  0.250   5  15  26
14   猛龙  负   主   8   25  0.320  0.273   6  11  38
15   太阳  胜   客  12   22  0.545  0.545   2   7  48
16   灰熊  胜   客   9   20  0.450  0.500   5   7  29
17   掘金  胜   主   6   16  0.375  0.143   8   9  21
18  尼克斯  胜   主  12   27  0.444  0.385   2  10  37
19   篮网  胜   主  13   20  0.650  0.615  10   8  37
20  步行者  胜   主   8   22  0.364  0.333   8  10  29
21   湖人  胜   客  13   22  0.591  0.444   4   9  36
22   爵士  胜   客   8   19  0.421  0.333   5   3  29
23  开拓者  胜   客  16   29  0.552  0.571   8   3  48
24   鹈鹕  胜   主   8   16  0.500  0.400   1  17  26

In [49]:
# 查看主客场下的数据,分类条件为对手的主客场
df.pivot_table(index=['对手','主客场'],values=['得分','篮板','助攻'])

           助攻    得分    篮板
对手  主客场
勇士  客    11.0  27.0   6.0
国王  客     9.0  27.0   3.0
太阳  客     7.0  48.0   2.0
小牛  主     7.0  29.0   3.0
尼克斯 主    10.0  37.0   2.0
    客     9.0  31.0   5.0
开拓者 客     3.0  48.0   8.0
掘金  主     9.0  21.0   8.0
步行者 主    10.0  29.0   8.0
    客    15.0  26.0   5.0
湖人  客     9.0  36.0   4.0
灰熊  主     8.0  30.0   4.5
    客     7.5  24.5   4.5
爵士  主    13.0  56.0   2.0
    客     3.0  29.0   5.0
猛龙  主    11.0  38.0   6.0
篮网  主     8.0  37.0  10.0
老鹰  客    11.0  29.0   3.0
骑士  主    13.0  35.0  11.0
鹈鹕  主    17.0  26.0   1.0
黄蜂  客    11.0  27.0  10.0

In [58]:
df.pivot_table(index=['主客场','胜负'],values=['得分','篮板','助攻'])

               助攻         得分        篮板
主客场 胜负
主   胜   10.555556  34.222222  5.444444
    负    9.500000  30.000000  5.500000
客   胜    8.636364  32.454545  5.090909
    负    8.000000  20.000000  4.000000

In [57]:
# 查看主客场下的数据,分类条件为对手的主客场,并且计算每个主客场的平均得分
df.pivot_table(index=['主客场','胜负'],values=['得分','篮板','助攻'], aggfunc='sum')

        助攻   得分  篮板
主客场 胜负
主   胜   95  308  49
    负   19   60  11
客   胜   95  357  56
    负    8   20   4

In [60]:
# 获取所有队主客场的总得分
df.pivot_table(index='主客场',values='得分',aggfunc='sum')

      得分
主客场
主    368
客    377

In [64]:
# 获取每个队主客场的总得分 (在总得分的基础上又进行了对手的分类)
df.pivot_table(index='主客场',columns='对手',values='得分',aggfunc='sum',fill_value=0)

对手   勇士  国王  太阳  小牛  尼克斯  开拓者  掘金  步行者  湖人  灰熊  爵士  猛龙  篮网  老鹰  骑士  鹈鹕  黄蜂
主客场
主     0   0   0  29   37    0  21   29   0  60  56  38  37   0  35  26   0
客    27  27  48   0   31   48   0   26  36  49  29   0   0  29   0   0  27

### 交叉表
  - 是一种用于计算分组的特殊透视表,对数据进行汇总
  - pd.crosstab(index,columns,values)
     - index: 分组数据,交叉表的行索引
     - columns: 交叉表的列索引

In [65]:
import pandas as pd
from pandas import DataFrame

In [66]:
df = DataFrame({'sex': ['man','man','women','women','man'],
                'age': [15,23,25,17,35],
                'smoke': [True,False,True,False,False],
                'height': [168,179,181,166,173],})
df

     sex  age  smoke  height
0    man   15   True     168
1    man   23  False     179
2  women   25   True     181
3  women   17  False     166
4    man   35  False     173

In [68]:
# 求出各个性别抽烟的人数
pd.crosstab(df.smoke,df.sex)

sex    man  women
smoke
False    2      1
True     1      1

In [70]:
# 求出各个年龄段抽烟人情况
pd.crosstab(df.age,df.smoke)

smoke  False  True
age
15         0      1
17         1      0
23         1      0
25         0      1
35         1      0